# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [2]:
#Your code here
import sqlite3
import pandas as pd

conn = sqlite3.connect('data.sqlite')
c = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [9]:
#Your code here
c.execute('''SELECT *
             FROM employees
             LEFT JOIN offices
             USING(officeCode)
             WHERE city = "Boston";''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle,city,phone,addressLine1,addressLine2,state,country,postalCode,territory
0,1188,Firrelli,Julie,x2173,jfirrelli@classicmodelcars.com,2,1143,Sales Rep,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NA
1,1216,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143,Sales Rep,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NA

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [19]:
#Your code here
c.execute('''SELECT count(e.employeeNumber) as num_employees, o.city
             FROM offices as o
             LEFT JOIN employees as e
             USING(officeCode)
             GROUP BY o.city;''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

   num_employees           city
0              2         Boston
1              2         London
2              2            NYC
3              5          Paris
4              6  San Francisco
5              4         Sydney
6              2          Tokyo

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold

In [29]:
# Your code here
c.execute('''SELECT e.firstName, e.lastName, p.productName
             FROM employees as e
             LEFT JOIN customers as c
             ON e.employeeNumber = c.salesRepEmployeeNumber
             JOIN orders as o
             USING(customerNumber)
             LEFT JOIN orderdetails as od
             USING(orderNumber)
             LEFT JOIN products as p
             USING(productCode);''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
print(len(df))
df.head()

2996

  firstName  lastName                                  productName
0    Leslie  Jennings                               1958 Setra Bus
1    Leslie  Jennings                       1940 Ford Pickup Truck
2    Leslie  Jennings                      1939 Cadillac Limousine
3    Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4    Leslie  Jennings                            1968 Ford Mustang

## Level Up: Display the Number of Products each employee has sold

In [31]:
#Your code here
c.execute('''SELECT e.firstName, e.lastName, count(productName) as num_products
             FROM employees as e
             LEFT JOIN customers as c
             ON e.employeeNumber = c.salesRepEmployeeNumber
             JOIN orders as o
             USING(customerNumber)
             LEFT JOIN orderdetails as od
             USING(orderNumber)
             LEFT JOIN products as p
             USING(productCode)
             GROUP BY e.employeeNumber;''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
print(len(df))
df

15

   firstName   lastName  num_products
0     Leslie   Jennings           331
1     Leslie   Thompson           114
2      Julie   Firrelli           124
3      Steve  Patterson           152
4   Foon Yue      Tseng           142
5     George     Vanauf           211
6       Loui     Bondur           177
7     Gerard  Hernandez           396
8     Pamela   Castillo           272
9      Larry       Bott           236
10     Barry      Jones           220
11      Andy     Fixter           185
12     Peter      Marsh           185
13      Mami      Nishi           137
14    Martin     Gerard           114

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!